export const prefecture = [
    "北海道","青森県","岩手県","宮城県","秋田県","山形県","福島県",
    "茨城県","栃木県","群馬県","埼玉県","千葉県","東京都","神奈川県",
    "新潟県","富山県","石川県","福井県","山梨県","長野県","岐阜県",
    "静岡県","愛知県","三重県","滋賀県","京都府","大阪府","兵庫県",
    "奈良県","和歌山県","鳥取県","島根県","岡山県","広島県","山口県",
    "徳島県","香川県","愛媛県","高知県","福岡県","佐賀県","長崎県",
    "熊本県","大分県","宮崎県","鹿児島県","沖縄県"
];

export const intensityStyle = [
    'intst-lowest',
    'intst-lowest',
    'intst-endurance',
    'intst-tempo',
    'intst-LactateThreshold',
    'intst-VO2Max',
    'intst-AnaerobicCapacity',
    'intst-NeuromuscularPower',
    'intst-highest'
];

export const intensityComment = [
    'ゆるポタ(非競技勢向け)。体力や技術の向上を目的としないライドなど。',
    'ゆるポタ(競技勢向け)。体力や技術の向上を目的としないライドや回復走など。',
    '(L1-L2) LSDなどの低強度エンデュランストレーニング。もしくは技術を目的とした練習。',
    '(L3) テンポ走などのエンデュランストレーニングや1時間以上のペース走、峠TTなど。',
    '(L4) インターバル10-60分のFTP、筋持久力の向上を目的としたトレーニングや峠TT、ペース走など。',
    '(L5) インターバル3-8分のVO2maxの向上を目的としたトレーニングや登坂アタックなど。',
    '(L6) インターバル2分以下の無酸素能力の向上を目的としたトレーニングや登坂アタックなど。',
    '(L7) インターバル30秒以下のスプリント能力の向上を目的としたトレーニング。',
    'レース走などレース強度での走行。時間に問わず、レース同様に力を出し切るトレーニング・練習。',
];


